[
  {
    "Ready for Publication": "TRUE",
    "Name": "Englander Knabe and Allen",
    "Category": "Lobbyists",
    "Location": "Los Angeles",
    "Donations directly to Mitch": "$14,200.00",
    "Donations to Mitch-supporting PACs": "",
    "Description heading": "Real Lobbyist Housewives of Los Angeles",
    "Blurb": "Got a controversial development you want push? Want the best terms for your towing impound lot? Want a big juicy city contract for your waste hauling business? Just hire the lobbying firm of Englander Knabe and Allen (EKA). Founding EKA partner Harvey Englander's nephew Mitchell Englander just got out of jail, where he served 14 months for taking bribes from developers while partying in Las Vegas and Palm Springs. As registered lobbyists EKA isn't supposed to donate money to Mitch O'Farrell but that pesky little rule didn't stop these grifters. They funnel campaign donations to O'Farrell's through EKA partner Matt Knabe's wife Briana Knabe, EKA partner Jeff McConnel's wife Erika McConnell, EKA partner Eric Rose's wife Marci Rose, and EKA partner Marcus Allen's wife Janet Porush.",
    "Links": "https://i.imgur.com/NbTyfbE.png",
    "Photo Source": "Got a controversial development you want push? Want the best terms for your towing impound lot? Want a big juicy city contract for your waste hauling business? Just hire the lobbying firm of Englander Knabe and Allen (EKA). Founding EKA partner Harvey Englander's nephew Mitchell Englander just got out of the pokey, where he served 14 months for taking bribes from developers while partying in Las Vegas and Palm Springs. Harvey's failson Adam serves as EKA'S general council. You want a meeting with Mitch O'Farrell? Hire EKA and they'll get you on the councilman's schedule. As registered lobbyists EKA isn't supposed to donate money to Mitch O'Farrell but that pesky little rule didn't top these grifters. They funnel campaign donations to O'Farrell's through EKA partner Matt Knabe's wife Briana Knabe, EKA patner Jeff McConnel's wife Erika McConnell, EKA partner Eric Rose's wife Marci Rose, EKA partner Marcus Allen's wife Janet Porush. Erika McConnell is the second most generous donor to all 2022 elections in Los Angeles, Briana is #6 and Marci is #7. ",
    "": "https://twitter.com/kennethmejiaLA/status/1423385665367023616"
  },
  {
    "Ready for Publication": "TRUE",
    "Name": "Matthew Klink",
    "Category": "Lobbyist",
    "Location": "Studio City",
    "Donations directly to Mitch": "$500",
    "Donations to Mitch-supporting PACs": "",
    "Description heading": "Republican lobbyist for real estate, tobacco, oil and gas companies",
    "Blurb": "For someone who thinks of himself as “progressive,” Mitch has some curiously far right patrons. Meet Mitch fanboy Matthew Klink, a Republican strategist and lobbyist for all the sleaziest causes, tobacco, casinos, luxury developments, oil and gas companies. But that’s not all, Klink also served as the communications director for the No on 15 campaign, helping defeat an initiative that would have taxed wealthy landowners to fund badly needed city services.",
    "Links": "https://i.imgur.com/vKVEBiQ.png",
    "Photo Source": "For someone who thinks of himself as “progressive,” Mitch has some curiously far right patrons. Meet Mitch fanboy Matthew Klink, a Republican strategist and lobbyist for all the sleaziest causes, tobacco, casinos, luxury developments, oil and gas companies. But that’s not all, Klink served as the communications director for the No on 15 campaign, helping defeat an initiative that would have taxed wealthy landowners to fund badly needed city services. ",
    "": "https://calstrat.com/people/matthew-klink/"
  },
  {
    "Ready for Publication": "TRUE",
    "Name": "Jennifer LoGrande",
    "Category": "Lobbyist",
    "Location": "Long Beach",
    "Donations directly to Mitch": "$800",
    "Donations to Mitch-supporting PACs": "",
    "Description heading": "Wife of unethical revolving door lobbyist",
    "Blurb": "While Michael LoGrande was being paid $18,000 a month by the City of LA Planning department, he was simultaneously and illegally lobbying on behalf of developers with projects all over the city. As the former planning director for LA, it’s strictly forbidden to lobby city officials within a year of leaving his job. The Ethics Commision fined LoGrande $281,250, the largest fine ever for a former city employee. It is also an ethical violation to donate to Mitch, but LoGrande is not one to play by the rules when it comes to doing the dirty work for his developer clients, so he laundered his contribution through his wife Jennifer LoGrande. One of his clients, Vella Group, also generously lines Mitch’s pockets.",
    "Links": "https://i.imgur.com/if2V7Gy.png",
    "Photo Source": "While Michael LoGrande was being paid $18,000 a month by the City of LA Planning department, he was simultaneously and illegally lobbying on behalf of developers with projects all over the city. As the former planning director for LA, it’s against the law to lobby city officials within a year of leaving his job. The Ethics Commision fined LoGrande $281,250, the largest fine ever for a former city employee. He’s also not supposed to donate to Mitch, but LoGrande is not one to play by the rules when it comes to doing the dirty work for his developer clients. So he laundered his contribution through his wife Jennifer LoGrande. One of his clients, Vella Group, also generously lines Mitch’s pockets.",
    "": "https://www.latimes.com/california/story/2019-08-20/ethics-fine-planning-director-illegal-lobbying-los-angeles"
  },
  {
    "Ready for Publication": "TRUE",
    "Name": "Lena Wu",
    "Category": "Lobbyist",
    "Location": "Sacramento",
    "Donations directly to Mitch": "$800",
    "Donations to Mitch-supporting PACs": "",
    "Description heading": "Wife of oil, tobacco and pharmeceutical lobbyist",
    "Blurb": "Felipe Fuentes is a former LA City Councilman who traded that job for a lucrative position as a Sacramento lobbyist for the Apex Group in Sacramento. Apex represents all the worst clients including oil, tobacco and pharmaceutical companies. They also have a side hustle in alcohol permits in Los Angeles. Like so many other lobbyists, he launders his contribution through his wife Lena Wu who lists her occupation as “homemaker.”",
    "Links": "https://i.imgur.com/3cO76Bv.png",
    "Photo Source": "Felipe Fuentes is a former LA City Councilman who traded that job for a lucrative position as a Sacramento lobbyist for the Apex Group in Sacramento. Apex represents all the worst clients including oil, tobacco and pharmaceutical companies. They also have a side hustle in alcohol permits in Los Angeles. Like so many other lobbyists, he launders his contribution through his wife Lena Wu who lists her occupation as “homemaker.”",
    "": ""
  },
  {
    "Ready for Publication": "TRUE",
    "Name": "Dart Container",
    "Category": "Lobbyist",
    "Location": "Mason, Michigan",
    "Donations directly to Mitch": "$1,500.00",
    "Donations to Mitch-supporting PACs": "line 880 in list, 2 donations 2016+2017",
    "Description heading": "That Sweet Styrofoam Money",
    "Blurb": "Dart Container is a company that produces styrofoam packaging, and used its immense wealth to kneecap two state bills that would have banned styrofoam containers. While other cities have banned single-use styrofoam containers in restaurants, Mitch was happy to take that sweet sweet styrofoam money and pass a softer “plastic utensils on request” ordinance. We know Mitch likes the appearance of doing something, while allowing Big Plastic industries to fill our waterways with plastic particles that will circulate for eternity.",
    "Links": "https://i.imgur.com/86dVkzr.png",
    "Photo Source": "While other cities have banned single-use styrofoam containers in restaurants, Mitch was happy to take that sweet sweet styrofoam money from Dart Container and delay a full ban. \nLA is behind way behind other cities such as Seattle which banned styrofoam containers back in 2009 and and San Francisco which enacted a ban in 2017. Mitch’s styrofoam patron Kenneth Dart, the secretive billionaire behind Dart Container, renounced his U.S. citizenship and lives tax free in the Cayman Islands where he’s the only resident of a massive hotel when he’s not out on his torpedo proof yacht. ",
    "": "https://www.nytimes.com/2019/10/18/business/kenneth-dart-cayman-islands.html"
  }
]
