[
  {
    "Name": "Dart Container Corporation",
    "Category": "Big Corporation, Environment",
    "Donations directly to David": "$1,600",
    "Blurb": "Dart is a single-use container behemoth. The [empire](https://www.nytimes.com/2020/02/10/business/dart-foam-recycling.html) is built on the kind of disposable items--coffee cup lids, plastic knives and forks--that Americans have come to rely on. But the harm of single use plastics and styrofoam is [well documented](https://greendiningalliance.org/2016/12/the-real-cost-of-styrofoam/). It takes forever to break down. [Fish mistake it for food and eat it](https://www.nationalgeographic.com/news/2017/08/ocean-life-eats-plastic-larvaceans-anchovy-environment/), sending contamination up the food chain. It’s also notoriously hard to recycle and many municipal programs have stopped even accepting it. Sixty countries have banned these types of single use containers. Maine and Maryland banned them in 2019, the same year Andrew Cuomo [proposed a state-wide ban](https://www.nytimes.com/2019/12/23/nyregion/foam-containers-ban-ny.html) in New York. \n\nBut Dart is not giving up without a fight. When the city of San Diego instituted a ban on polystyrene foam and single use plastics, they were [sued](https://www.nbcsandiego.com/news/local/local-restaurant-owners-sue-city-over-styrofoam-ban/2229928/) by Dart, the California Restaurant Association and three local restaurant owners; forcing the city to [suspend the ban](https://www.sandiego.gov/environmental-services/recycling/pf-ban) pending an environmental impact report. Clearly Dart doesn’t want Los Angeles going any further with plastic and foam bans because they’ve spent thousands of dollars donating to Ryu and almost every other member of the city council for years. \n\nIn addition to Dart’s products not being great for the environment, the company’s scions aren’t great either. Kenneth and Robert Dart are the billionaire heirs to their father’s company. Although they have moved on to other interests like running vulture funds that [destabilize governments](https://www.independent.co.uk/news/business/news/vulture-funds-circle-greece-fears-grow-7758127.html). Both were so averse to [paying their taxes](https://web.archive.org/web/20130507131814/http://www.forbes.com/forbes/2003/0721/052_print.html) that they renounced their citizenship and left the country; one to London, the other to [The Cayman Islands](https://www.nytimes.com/2019/10/18/business/kenneth-dart-cayman-islands.html?searchResultPosition=1)."
  },
  {
    "Name": "Andrew Lee / Golden State Leadership Fund",
    "Category": "Big Corporation, Real Estate / Developer",
    "Donations to David-supporting PACs": "$151,450",
    "Blurb": "In February, tech entrepreneur Lee pumped [$100,000](https://www.latimes.com/california/story/2020-02-26/outside-spending-los-angeles-city-hall-election) into the Golden State Leadership Fund. He started the fund with businessman Myung Hong; who is a board member of the Korean American National Museum project that just so happens to be leasing land from the city of Los Angeles. After securing a plum 50 year lease for a city parking lot, they wowed officials with a three story museum concept complete with 100 units of market rate housing. Only to [scrap the housing element completely](https://urbanize.la/post/korean-american-national-museum-drops-plans-housing) citing the classic “rising construction costs.”  They will probably keep the planned 144 car garage though. \n\nLee’s donation to the GSLF was the biggest individual donation out of a cool million that Ryu had amassed by that point. This was four times what his opponents had received. Lee added to that in August with an additional $48,000 through a different committee, Lead & Reform LA - Residents For David Ryu For City Council. Lee is a tech millionaire who just happens to be an actual [prince](https://www.scmp.com/week-asia/people/article/2175439/no-k-drama-fresh-prince-south-korea-real-royalty-and-hes-american) and heir to an obscure Korean dynasty. No, seriously. There was a ceremony where he swore on a sword and everything. Ask David Ryu, he was there."
  },
  {
    "Name": "Steve Sungho Lee / Steele Industries",
    "Category": "Corruption, Homelessness, Real Estate / Developer",
    "Donations directly to David": "$700",
    "Donations to David-supporting PACs": "$35,000",
    "Blurb": "Lee was a bigger player in the 2016 race but he’s still relevant. (More on that later) After promising not to take developer cash, Ryu was the beneficiary of huge outside spending from people like Lee in ‘16. Lee’s Steele industries spent [$35,000 alone pushing Ryu to Latino voters, and $13,000 on phone banking](https://www.latimes.com/local/cityhall/la-me-outside-money-20150512-story.html).\n\nThe first red flag is that Lee, a self described real estate developer, gave tons of cash to disgraced former city council member Jose Huizar. Huizar is currently facing [34 felony counts](https://www.latimes.com/california/story/2020-08-03/jose-huizar-los-angeles-city-councilman-plea-corruption-case) including bribery, money laundering, mail fraud, wire fraud and tax evasion. Huizar has pleaded not guilty, but his former aide George Esparza has [pleaded guilty](https://www.justice.gov/usao-cdca/pr/former-aide-la-city-councilmember-agrees-plead-guilty-rico-charge-stemming-pay-play); as have real estate consultant George Chiang and fundraiser Justin Jangwoo Kim and other [disgraced former city councilmember Mitch Englander](https://www.latimes.com/california/story/2020-07-07/los-angeles-city-hall-corruption-mitchell-englander).\n\nLee owns several large buildings downtown in the “bong district.” In this part of the city,  some of these buildings are used to store massive amounts of butane oil used for products in the smoking/vaping industries. One of Lee’s buildings was being used for such purposes and the products [exploded](https://www.latimes.com/california/story/2020-05-16/explosion-in-downtown-l-a-leaves-multiple-buildings-on-fire). The resulting fire spread to another one of Lee’s buildings and two others nearby, not owned by Lee. Thankfully, the other two buildings that he owns downtown were unharmed. Eventually the Los Angeles City Attorney charged multiple building owners with a collective [300 criminal charges](https://www.latimes.com/california/story/2020-08-21/owners-connected-to-massive-downtown-los-angeles-explosion-face-300-criminal-charges). Lee himself was hit with 82 charges. It’s well known that these buildings are all storing these chemicals improperly and in massive quantities, in direct violation of the law. The city might have caught the massive amounts being stored there, but as it turns out the city had [never inspected the building](https://mynewsla.com/crime/2020/09/14/times-reports-no-record-of-building-inspection-prior-to-downtown-explosion/). Massive amounts of city damage, [twelve firefighters seriously injured](https://www.npr.org/2020/05/17/857537268/11-firefighters-injured-in-los-angeles-blaze-explosion), jobs destroyed, hours and hours of litigation tying up the court system, and all because of corrupt developers like Lee who funnel money to people like Ryu.\n\nAt another one of his downtown properties, he [illegally installed sprinklers](http://www.ladowntownnews.com/news/how-sprinklers-target-the-homeless-in-the-industrial-district/article_6cd1a5e0-f567-11e6-b9b6-3bc354ddfda2.html) outside to deter the unhoused. Oh, and when journalist Eddie Kim wrote about it, Lee [threatened to get him fired](https://twitter.com/eddiekimx/status/1296855231980908544)."
  },
  {
    "Name": "Mike Nijjar / PAMA Management",
    "Category": "Big Corporation, Environment, Real Estate / Developer",
    "Donations directly to David": "$1,600",
    "Blurb": "Nijjar is the CEO of PAMA Management. PAMA is a  $1.3 billion real estate management empire whose holdings stretch all the way into Texas. PAMA rents to mostly low-income residents who have very few other options for housing. With nowhere else to turn, PAMA knows that they can subject them to sub-human circumstances. Some of the horrible conditions that PAMA residents face are documented in this [LAist piece](https://laist.com/projects/2020/pama/) including: Reports of bed bug infestations, rats, mold, and a typhus outbreak at a Pomona mobile home park that got the attention of the Centers for Disease Control. The walls and wiring were notoriously shoddy in PAMA properties. After a 5-month-old died in a PAMA trailer park, state fire investigators determined that the mobile home was not permitted for human occupancy and should never have been rented out. Tenants who complained about the conditions at Fontana apartment complex alleged in a [lawsuit](https://www.sbsun.com/2010/03/24/fontana-apartment-tenants-spar-with-landlord-over-living-conditions/) that they were singled out for eviction notices that came if rent was one day late.\n\nThings got so bad at one of his properties in Baldwin Village that Los Angeles city attorney Mike Feuer filed a [lawsuit](https://patch.com/california/los-angeles/la-aims-force-landlord-live-his-own-crime-ridden-complex) hoping to force the owners and managers of the Chesapeake Apartments to have to live in the complex themselves.\n\nAfter getting [called out](https://laist.com/2020/02/14/pama-landlord-investigation-ryu-wicks.php) on the donation, Ryu returned the money."
  },
  {
    "Name": "LA Police Protective League",
    "Category": "Police Money",
    "Donations directly to David": "$0",
    "Donations to David-supporting PACs": "$44,933.89",
    "Blurb": "This one is very cut & dried. There is a reason why a campaign mailer declared him “the choice of law enforcement.” Until the political winds shifted during this spring and summer, David Ryu was one of the biggest recipients of police money in all of Los Angeles politics. \n\nRyu was the beneficiary of a $45,000 Independent Expenditure Committee from the Los Angeles Police Protective League. He was one of two candidates they supported in the primary, but they spent twice as much on Ryu as on the other candidate. Now Ryu tries to pretend that [he has long been concerned](https://www.latimes.com/california/story/2020-06-10/lapd-union-political-donations) about the size of the LAPD’s budget. But when journalist Hayes Davenport asked Ryu if there was evidence of his concern, [there was no response](https://twitter.com/hayesdavenport/status/1270764252043698176).\n\nIn addition to the money he’s taken from the LAPPL over the years, he’s also gotten contributions from other  pro-law enforcement groups  Los Angeles Airport Peace Officers Association and the incredibly ominous sounding Black Knight Patrol; a private security firm made up of ex military and law enforcement. With her background for the unhoused, Nithy has long understood how the less fortunate of us often end up as the victims of police violence as you can hear her explain in this [January interview](https://youtu.be/Sdk6yKIjKiw?t=198).\n\nThe LAPD budget represents  a $1 billion dollar albatross around our collective necks. Since January 2000, [902 people have been killed by the police](https://homicide.latimes.com/officer_involved/true/year/all) in Los Angeles County. It is time for us to remove these violent perpetrators from our streets, and divert those much needed resources to more useful city agencies. Meanwhile, David Ryu’s website is still touting outdated theories like “community based policing” and  “anger management training and conflict resolution.” It’s clear he is not fit to lead on this issue. "
  }
]
